Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: https://www.graalvm.org[GraalVM] is a universal virtual machine for running applications written in various different languages, as well as providing the ability to compile JVM bytecode to a native executable (this native executable runs a special virtual machine called SubstrateVM). These native executables start much faster and can use a lot less memory than a traditional JVM, however not every JVM feature is supported, and some are more limited than normal.
zh_cn: https://www.graalvm.org[GraalVM] 是一个通用的虚拟机，用于运行用各种不同语言编写的应用程序，并提供将JVM字节码编译为原生可执行文件的能力(这个原生可执行文件运行一个名为SubstrateVM的特殊虚拟机)。与传统JVM相比，这些原生可执行文件启动速度更快，使用的内存也少得多，但是并不是所有JVM特性都得到支持，有些特性的限制比一般的要多。

source: https://www.jetbrains.com/help/idea/quarkus.html[IntelliJ IDEA Ultimate Edition built-in Quarkus support]
zh_cn: link:https://www.jetbrains.com/help/idea/quarkus.html[IntelliJ IDEA Ultimate版内置Quarkus支持]

source: https://www.jetbrains.com/idea/nextversion/[Installer]
zh_cn: link:https://www.jetbrains.com/idea/nextversion/[安装程序]

source: https://www.keycloak.org/docs/latest/server_installation/index.html[Keycloak]
zh_cn: link:https://www.keycloak.org/docs/latest/server_installation/index.html[Keycloak]

source: https://www.redhat.com/en/blog/introducing-red-hat-universal-base-image[Introduction to Universal Base Image]
zh_cn: https://www.redhat.com/en/blog/introducing-red-hat-universal-base-image[通用基础镜像介绍]

source: if a reply handler is set, then the failure is propagated back to the sender via an `io.vertx.core.eventbus.ReplyException` with code `ConsumeEvent#FAILURE_CODE` and the exception message,
zh_cn: 如果设置了一个回复处理程序，那么失败就会通过一个带有代码 `ConsumeEvent#FAILURE_CODE` 和异常消息的 `io.vertx.core.eventbus.ReplyException` 传播回发送者，

source: if no reply handler is set, then the exception is rethrown (and wrapped in a `RuntimeException` if necessary) and can be handled by the default exception handler, i.e. `io.vertx.core.Vertx#exceptionHandler()`.
zh_cn: 如果没有设置回复处理程序，那么异常会被重新抛出（如果需要的话，会被包裹在一个 `RuntimeException` ），并且可以由默认的异常处理程序来处理，即 `io.vertx.core.Vertx#exceptionHandler()` 。

source: if not set, the connector looks for a `Map` with the channel name or the configured `kafka-configuration` (if set) and the value is retrieved from that `Map`
zh_cn: 如果没有设置，连接器会使用 channel 名称或 `kafka-configuration` (如果设置了)来查找查找一个 `Map` ，并从 `Map` 中取值

source: if set to true, the access will be denied to all CDI methods and JAX-RS endpoints that do not have security annotations but are defined in classes that contain methods with security annotations. Defaults to `false`.
zh_cn: 如果设置为 "true"，所有没有加安全注解但被定义在包含安全注解的方法的类中的CDI方法和JAX-RS节点的访问将被拒绝。默认为 `false` 。

source: if you see `java.security.InvalidAlgorithmParameterException: the trustAnchors parameter must be non-empty` or similar SSL error, due to the current status of GraalVM, there is some additional work to bundle the `function.zip`, as below. For more information, please see the xref:native-and-ssl.adoc[Quarkus Native SSL Guide].
zh_cn: 如果你看到 `java.security.InvalidAlgorithmParameterException: the trustAnchors parameter must be non-empty` 或类似的SSL错误，由于GraalVM的当前状态，有一些额外的工作来捆绑 `function.zip` ，如下所示。更多信息，请参见 link:native-and-ssl.html[Quarkus Native SSL指南] 。

source: image:containerization-process.png[Containerization Process]
zh_cn: image:containerization-process.png[容器化过程]

source: image:native-executable-process.png[Creating a native executable]
zh_cn: image:native-executable-process.png[创建原生可执行文件]

source: image:{che-logo}[Eclipse Che,100,100] {empty} + Eclipse Che
zh_cn: image:{che-logo}[alt="Eclipse Che", width="100", height="100"] Eclipse Che

source: image:{eclipse-logo}[Eclipse,100,100] {empty} + Eclipse Quarkus Tools
zh_cn: image:{eclipse-logo}[alt="Eclipse", width="100", height="100"] Eclipse Quarkus工具

source: image:{intellij-logo}[IntelliJ,100,100] {empty} + IntelliJ IDEA Ultimate
zh_cn: image:{intellij-logo}[alt="IntelliJ", width="100", height="100"] IntelliJ IDEA Ultimate

source: image:{intellij-logo}[IntelliJ,100,100] {empty} + IntelliJ Quarkus Tools
zh_cn: image:{intellij-logo}[alt="IntelliJ", width="100", height="100"] IntelliJ Quarkus工具

source: image:{vscode-logo}[VSCode,100,100] {empty} + VSCode Quarkus Tools
zh_cn: image:{vscode-logo}[alt="VSCode", width="100", height="100"] VSCode Quarkus工具

source: import the project in your favorite IDE
zh_cn: 在你喜欢的编辑器里面导入项目

source: in case multiple Avro serdes are present, serializer/deserializer must be configured manually for Avro-generated classes, because autodetection is impossible
zh_cn: 如果存在多个Avro serdes，必须为Avro生成的类手动配置序列化器/反序列化器，因为这种情况下无法进行自动侦测

source: in order to ensure that various resources are included and additional reflection is registered.
zh_cn: 以确保各种资源被包括在内，并注册了额外的反射。

source: in the `gdb` prompt.
zh_cn: 在 `gdb` 提示中。

source: in the context of an application, you will rely on configuring the `native-image` configuration by tweaking your `pom.xml`;
zh_cn: 在应用程序里面，你将通过 `pom.xml` 来调整 `native-image` 的配置

source: in the context of an extension, Quarkus offers a lot of infrastructure to simplify all of this.
zh_cn: 在扩展里面，Quarkus提供了很多基础设施来简化这一切

source: isHttps is false as https is not used
zh_cn: isHttps为false，因为没有使用https

source: it is technically not needed to subclass `JsonbSerializer`, but in such case, autodetection isn't possible
zh_cn: 技术上不需要对 `JsonbSerializer` 子类化，但在这种情况下无法进行自动侦测

source: it is technically not needed to subclass `ObjectMapperSerializer`, but in such case, autodetection isn't possible
zh_cn: 技术上不需要对 `ObjectMapperSerializer` 子类化，但在这种情况下无法进行自动侦测

source: it's in asciidoc format, there is an example as shown with [2019-06-05-quarkus-and-web-ui-development-mode.adoc](https://github.com/quarkusio/quarkusio.github.io/blob/develop/_posts/2019-06-05-quarkus-and-web-ui-development-mode.adoc)
zh_cn: 它是asciidoc格式的，有一个示例显示 [2019-06-05-quarkus-and-web-ui-development-mode.adoc](https://github.com/quarkusio/quarkusio.github.io/blob/develop/_posts/2019-06-05-quarkus-and-web-ui-development-mode.adoc)

source: jbang Integration
zh_cn: jbang整合

source: link:http://hibernate.org/reactive/[Hibernate Reactive] is the only reactive JPA implementation and offers you the full breadth of an Object Relational Mapper allowing you to access your database over reactive drivers. It makes complex mappings possible, but it does not make simple and common mappings trivial. Hibernate Reactive with Panache focuses on making your entities trivial and fun to write in Quarkus.
zh_cn: link:http://hibernate.org/reactive/[Hibernate Reactive] 是唯一的响应式JPA实现，提供了全方位的对象关系映射（Object Relational Mapper，简称ORM）支持，支持通过响应式驱动访问数据库。它使复杂的映射成为可能，它支持编写复杂的映射，但编写简单常用的映射却不够简便。Hibernate Reactive Panache专注于简化ORM实体，让你的Quarkus开发有趣。

source: link:https://tools.ietf.org/html/rfc7515[JSON Web Signature]
zh_cn: link:https://tools.ietf.org/html/rfc7515[JSON网络签名]

source: link:https://tools.ietf.org/html/rfc7516[JSON Web Encryption]
zh_cn: link:https://tools.ietf.org/html/rfc7516[JSON网络加密]

source: link:https://tools.ietf.org/html/rfc7518[JSON Web Algorithms]
zh_cn: link:https://tools.ietf.org/html/rfc7518[JSON网络算法]

source: link:https://tools.ietf.org/html/rfc7519[JSON Web Token]
zh_cn: link:https://tools.ietf.org/html/rfc7519[JSON网络令牌]

source: link:https://vertx.io/docs/vertx-core/java/#_verticles[Verticles] is "a simple, scalable, actor-like deployment and concurrency model" provided by _Vert.x_. This model does not claim to be a strict actor-model implementation, but it shares similarities, especially concerning concurrency, scaling, and deployment. To use this model, you write and _deploy_ verticles, communicating by sending messages on the event bus.
zh_cn: link:https://vertx.io/docs/vertx-core/java/#<em>verticles[Verticles] 是_Vert.x提供的 "一个简单的、可扩展的、类似于演员的部署和并发模型"。这个模型并不声称是一个严格的actor-model实现，但它有相似之处，特别是关于并发、扩展和部署。为了使用这个模型，你编写和 _部署_ 顶点，通过在事件总线上发送消息进行通信。

source: make your entities extend `PanacheEntity` (optional if you are using the repository pattern)
zh_cn: 实体类改为继承 `PanacheEntity` 类（使用Repository模式时为可选操作）。

source: open a browser and go to http://localhost:8080/legumes.html
zh_cn: 打开浏览器，访问 http://localhost:8080/legumes.html

source: open a browser to `http://localhost:8080/fruits.html`
zh_cn: 打开浏览器访问 `http://localhost:8080/fruits.html`

source: openssl command for converting private key
zh_cn: openssl转换私钥的命令

source: openssl commands for generating keys
zh_cn: 用于生成密钥的openssl命令

source: or <a href="https://gradle.org/" target="_blank">Gradle</a>
zh_cn: 或<a href="https://gradle.org/" target="_blank">Gradle</a>

source: or if configuring the OTLP gRPC endpoint via JVM arguments:
zh_cn: 或者如果通过JVM参数配置OTLP gRPC节点：

source: or if you are using Jackson:
zh_cn: 或如果你在使用Jackson：

source: or if you do not have `LAMBDA_ROLE_ARN` already defined in this shell:
zh_cn: 或者如果在这个shell中没有定义 `LAMBDA_ROLE_ARN` ：

source: or set `enable.auto.commit` to true and annotate the consuming method with `@Acknowledgment(Acknowledgment.Strategy.NONE)`.
zh_cn: 要么将 `enable.auto.commit` 设置为true，并在consuming方法中使用 `@Acknowledgment(Acknowledgment.Strategy.NONE)` 注解。

source: or to build a native executable:
zh_cn: 或者构建一个原生可执行文件：

source: or, if you use the Gradle Kotlin DSL:
zh_cn: 或者，如果您使用Gradle Kotlin DSL:

source: point-to-point - send the message, one consumer receives it. If several consumers listen to the address, a round-robin is applied;
zh_cn: point-to-point - 发送消息，一个消费者接收。如果有几个消费者监听该地址，则采用轮流的方式；

source: primitive types or `String`
zh_cn: 原始类型或 `String`

source: publish/subscribe - publish a message; all the consumers listening to the address are receiving the message;
zh_cn: publish/subscribe - 发布一个消息；所有监听该地址的消费者都在接收该消息。

source: quarkus:dev Output
zh_cn: quarkus:dev 输出

source: request/reply - send the message and expect a response. The receiver can respond to the message in an asynchronous fashion.
zh_cn: request/reply - 发送消息并期望得到响应。接收者可以以异步的方式对消息作出回应。

source: scaffold a project in a single command line
zh_cn: 在单个命令行中为项目搭建脚手架

source: security at quarkus.io
zh_cn: quarkus.io 安全

source: see xref:kafka-schema-registry-avro.adoc[Using Apache Kafka with Schema Registry and Avro] for more information about using Confluent or Apicurio Registry libraries
zh_cn: 关于使用Confluent或Apicurio Registry的更多信息，请参见 link:kafka-schema-registry-avro.html[协同使用Apache Kafka，Schema Registry以及Avro]

source: send a pull request against the develop branch and voilà
zh_cn: 对开发分支发送一个博客的合并请求

source: send the `name` to the `greeting` address and request a response
zh_cn: 将 `name` 发送到 `greeting` 地址，并要求作出回应

source: set `use-anonymous-sender` to false
zh_cn: 将 `use-anonymous-sender` 设为false

source: set the destination address (anonymous sender are not supported)
zh_cn: 设置目的地地址（不支持匿名发送者）。

source: small (based on `ubi8-micro`)
zh_cn: 小的 (基于 `ubi8-micro` )

source: start Quarkus with:
zh_cn: 启动Quarkus：

source: support upx-compressed executables (more details on the xref:upx.adoc[enabling compression documentation])
zh_cn: 支持upx压缩的可执行文件（更多相关细节在 link:upx.html[启用压缩文档] 中）

source: tags is space separated list `tags:extension grpc`
zh_cn: 标记是由空格分隔的列表 `tags:extension grpc`

source: tags must be in lowercase
zh_cn: 标签必须英文小写

source: the Flyway extension
zh_cn: Flyway扩展

source: the HTTP method returns a `Uni`. If you are using RESTEasy Reactive, `Uni` support is built-in. If you are using _classic_ RESTEasy, you need to add the `quarkus resteasy-mutiny` extension to your project.
zh_cn: HTTP方法返回一个 `Uni` 。如果你使用的是RESTEasy Reactive， `Uni` 支持是内置的。如果你使用的是 _经典的_ RESTEasy，你需要在你的项目中添加 `quarkus resteasy-mutiny` 扩展。

source: the Hibernate ORM with Panache extension
zh_cn: Hibernate ORM with Panache扩展

source: the Hibernate Reactive with Panache extension
zh_cn: Hibernate Reactive with Panache扩展

source: the MariaDB/MySQL support is now in a separate dependency, MariaDB/MySQL users need to add the `flyway-mysql` dependency from now on.
zh_cn: MariaDB/MySQL的支持现在在一个单独的依赖中，MariaDB/MySQL的用户从现在开始需要添加 `flyway-mysql` 的依赖。

source: the Maven structure
zh_cn: Maven的结构

source: the Microsoft SQL Server support is now in a separate dependency, Microsoft SQL Server users need to add the `flyway-sqlserver` dependency from now on.
zh_cn: Microsoft SQL Server的支持现在在一个单独的依赖中，Microsoft SQL Server的用户从现在开始需要添加 `flyway-sqlserver` 的依赖。

source: the Quarkus Gradle plugin
zh_cn: Quarkus Gradle插件

source: the Vert.x Web Client
zh_cn: Vert.x 网络客户端

source: the Vert.x event bus
zh_cn: Vert.x 事件总线

source: the `amqp-host` or `amqp-port` is configured
zh_cn: `amqp-host` 或 `amqp-port` 已配置

source: the `kafka.bootstrap.servers` is configured
zh_cn: 配置了 `kafka.bootstrap.servers`

source: the `list()` method might be surprising at first. It takes fragments of HQL (JP-QL) queries and contextualizes the rest. That makes for very concise but yet readable code.
zh_cn: `list()` 方法一开始可能会让人吃惊。它只需要接收HQL（JP-QL）查询语句的片段，并对查询语句其余部分进行上下文推断处理。这使得代码非常简明，但也不失可读性。

source: the `list()` method might be surprising at first. It takes fragments of PanacheQL queries (subset of JPQL) and contextualizes the rest. That makes for very concise but yet readable code. MongoDB native queries are also supported.
zh_cn: `list()` 的方法一开始可能会让人吃惊。它采用PanacheQL查询的片段（JPQL的子集），并将其余部分进行上下文处理。这使得代码非常简明，但又可读。也支持MongoDB本地查询。

source: the `quarkus-app` directory which contains the `quarkus-run.jar` jar file - being an executable _jar_. Be aware that it's not an _über-jar_ as the dependencies are copied into subdirectories of `quarkus-app/lib/`.
zh_cn: `quarkus-app` 目录，其中包含 `quarkus-run.jar` jar文件--是一个可执行的 _jar_ 。请注意，它不是 _über-jar_ ，因为依赖项目被复制到 `quarkus-app/lib/` 的子目录中。

source: the application configuration file
zh_cn: 应用程序的配置文件

source: the attribute is set directly on the channel configuration (`mp.messaging.incoming.my-channel.attribute=value`),
zh_cn: 属性是直接在 channel 配置上设置的( `mp.messaging.incoming.my-channel.attribute=value` ),

source: the auto-detection did not find a matching serializer/deserializer
zh_cn: 自动侦测机制没有找到匹配的序列化器/反序列化器

source: the channel configuration defines the `cloud-events-type` and `cloud-events-source` attributes.
zh_cn: 通道配置定义了 `cloud-events-type` 和 `cloud-events-source` 属性。

source: the corresponding Java type
zh_cn: 对应的Java类型

source: the implementation needs to specify the type argument `T` as the (de-)serialized type.
zh_cn: 这些实现类需要指定类型参数 `T` 作为(反)序列化的类型。

source: the kafka password (the client secret from the service account)
zh_cn: kafka密码(来自service account的客户密码)

source: the managed instance of Vert.x
zh_cn: 被管理的 Vert.x 实例

source: the message metadata contains an `io.smallrye.reactive.messaging.ce.OutgoingCloudEventMetadata` instance,
zh_cn: 消息元数据包含一个 `io.smallrye.reactive.messaging.ce.OutgoingCloudEventMetadata` 实例。

source: the name of the client for multi-tenant application, see xref:mongodb.adoc#multiple-mongodb-clients[Multiple MongoDB Clients]. Otherwise, the default client will be used.
zh_cn: 多租户应用程序的客户端名称，见 link:mongodb.html#multiple-mongodb-clients[多个MongoDB客户端] 。否则，将使用默认客户端。

source: the name of the collection, otherwise the simple name of the class will be used.
zh_cn: 集合的名称，否则将使用该类的简单名称。

source: the name of the database, otherwise, the `quarkus.mongodb.database` property will be used.
zh_cn: 数据库的名称，否则，将使用 `quarkus.mongodb.database` 属性。

source: the serializer/deserializer is not configured
zh_cn: 序列化器/反序列化器未配置

source: then the behaviour is a bit different, because the transaction will not be terminated until the returned reactive value is terminated. In effect, the returned reactive value will be listened to and if it terminates exceptionally the transaction will be marked for rollback, and will be committed or rolled-back only at termination of the reactive value.
zh_cn: 那么行为就有点不同了，因为在返回的响应式值终止之前，事务不会被终止。实际上，返回的响应式值将被监听，如果它意外终止，事务将被标记为回滚，并且只有在响应式值终止时才会提交或回滚。

source: there is another guide if you need a xref:rest-client-reactive.adoc[REST client] (including support for JSON).
zh_cn: 如果你需要一个 link:rest-client-reactive.html[REST客户端] （包括对JSON的支持），还有另一个指南。

source: to set `auto.offset.reset = earliest`
zh_cn: 设置 `auto.offset.reset = earliest`

source: use the `throttled` policy,
zh_cn: 使用 `throttled` 策略,

source: username is anonymous
zh_cn: 用户名称是匿名的

source: what was described above is essentially the link:https://www.martinfowler.com/eaaCatalog/activeRecord.html[active record pattern], sometimes just called the entity pattern. Hibernate with Panache also allows for the use of the more classical link:https://martinfowler.com/eaaCatalog/repository.html[repository pattern] via `PanacheRepository`.
zh_cn: 上面所描述的编码模式本质上是 link:https://www.martinfowler.com/eaaCatalog/activeRecord.html[Active Record模式] ，有时也称为实体模式。Panache也支持通过 `PanacheRepository` 使用更经典的 link:https://martinfowler.com/eaaCatalog/repository.html[Repository模式] 。

source: what was described above is essentially the link:https://www.martinfowler.com/eaaCatalog/activeRecord.html[active record pattern], sometimes just called the entity pattern. MongoDB with Panache also allows for the use of the more classical link:https://martinfowler.com/eaaCatalog/repository.html[repository pattern] via `PanacheMongoRepository`.
zh_cn: 上面所描述的本质上是 link:https://www.martinfowler.com/eaaCatalog/activeRecord.html[活动记录模式] ，有时也称为实体模式。带有Panache的MongoDB也允许通过 `PanacheMongoRepository` ，使用更经典的 link:https://martinfowler.com/eaaCatalog/repository.html[存储库模式] 。

source: when we get the response, extract the body and send it to the user
zh_cn: 当我们得到响应时，提取正文并将其发送给用户

source: where `ProtectedResource` class may look like this:
zh_cn: 其中 `ProtectedResource` 类可能看起来像这样：

source: where `keycloak.version` should be set to `17.0.0` or higher.
zh_cn: 其中 `keycloak.version` 应该设置为 `17.0.0` 或更高。

source: which provides `io.quarkus.test.kafka.KafkaCompanionResource` - an implementation of `io.quarkus.test.common.QuarkusTestResourceLifecycleManager`.
zh_cn: 它提供了 `io.quarkus.test.kafka.KafkaCompanionResource` -- `io.quarkus.test.common.QuarkusTestResourceLifecycleManager` 的一种实现。

source: which provides `io.quarkus.test.keycloak.server.KeycloakTestResourceLifecycleManager` - an implementation of `io.quarkus.test.common.QuarkusTestResourceLifecycleManager` which starts a Keycloak container.
zh_cn: 它提供了 `io.quarkus.test.keycloak.server.KeycloakTestResourceLifecycleManager` - 一个 `io.quarkus.test.common.QuarkusTestResourceLifecycleManager` 的实现，用来启动一个Keycloak容器。

source: which provides a utility class `io.quarkus.test.keycloak.client.KeycloakTestClient` you can use in tests for acquiring the access tokens.
zh_cn: 其中提供了一个实用类 `io.quarkus.test.keycloak.client.KeycloakTestClient` ，你可以在测试中使用它来获取访问令牌。

source: will include:
zh_cn: 将包括：

source: xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library]
zh_cn: xref:mutiny-primer.adoc[Mutiny - 一个直观的响应式编程库]

source: xref:quarkus-reactive-architecture.adoc[The Quarkus Reactive Architecture]
zh_cn: xref:quarkus-reactive-architecture.adoc[Quarkus响应式架构]

source: xref:quarkus-runtime-base-image.adoc[This page] explains how to extend the `quarkus-micro` image when your application has specific requirements.
zh_cn: xref:quarkus-runtime-base-image.adoc[此页] 解释了当你的应用有特殊要求时，如何扩展 `quarkus-micro` 镜像。

source: xref:security-basic-auth-concept.adoc[Basic HTTP Authentication] and xref:security-built-in-authentication.adoc#form-auth[Form HTTP authentication] are the core authentication mechanisms supported in Quarkus.
zh_cn: xref:security-basic-auth-concept.adoc[Basic HTTP 认证] and xref:security-built-in-authentication.adoc#form-auth[Form HTTP 认证] 是Quarkus支持的核心认证机制。

source: xref:security-jwt-build.adoc[Sign and encrypt JWT tokens with SmallRye JWT Build]
zh_cn: xref:security-jwt-build.adoc[使用 SmallRye JWT Build 对 JWT 令牌进行签名和加密]

source: xref:security-keycloak-authorization.adoc[Using OpenID Connect (OIDC) and Keycloak to centralize authorization]
zh_cn: link:security-keycloak-authorization.html[使用OpenID连接（OIDC）和Keycloak来集中授权]

source: xref:security-openid-connect-client-reference.adoc[OpenID Connect and OAuth2 Client and Filters Reference Guide]
zh_cn: link:security-openid-connect-client.html[Quarkus - 使用OpenID Connect，OAuth2客户端和过滤器的参考指南]

source: xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] will launch a Keycloak container and import a `quarkus-realm.json`.
zh_cn: link:security-openid-connect-dev-services.html[Keycloak开发服务] 将启动一个Keycloak容器并导入一个 `quarkus-realm.json` 。

source: xref:security-openid-connect-multitenancy.adoc[Using OpenID Connect (OIDC) multi-tenancy]
zh_cn: link:security-openid-connect-multitenancy.html[使用OpenID连接（OIDC）多租户]

source: xref:security-openid-connect.adoc[Using OpenID Connect (OIDC) to protect service applications using Bearer Token authorization]
zh_cn: 关于Bearer Token认证机制的信息，请参见 link:security-openid-connect.html[使用OpenID Connect保护应用程序服务] 。

source: xref:spring-boot-properties.adoc[Quarkus - Extension for Spring Boot properties]
zh_cn: xref:spring-boot-properties.adoc[Quarkus - Spring Boot properties 扩展]

source: xref:spring-cache.adoc[Quarkus - Extension for Spring Cache]
zh_cn: xref:spring-cache.adoc[Quarkus - Spring Cache 扩展]

source: xref:spring-cloud-config-client.adoc[Quarkus - Reading properties from Spring Cloud Config Server]
zh_cn: xref:spring-cloud-config-client.adoc[Quarkus - 从Spring Cloud Config Server 中读取配置]

source: xref:spring-data-jpa.adoc[Quarkus - Extension for Spring Data JPA]
zh_cn: xref:spring-data-jpa.adoc[Quarkus - Spring Data JPA 扩展]

source: xref:spring-data-rest.adoc[Quarkus - Extension for Spring Data REST]
zh_cn: xref:spring-data-rest.adoc[Quarkus - Spring Data REST 扩展]

source: xref:spring-di.adoc[Quarkus - Extension for Spring DI]
zh_cn: link:spring-di.html[Quarkus - Spring DI 扩展]

source: xref:spring-scheduled.adoc[Quarkus - Extension for Spring Scheduled]
zh_cn: xref:spring-scheduled.adoc[Quarkus - Spring Scheduled 扩展]

source: xref:spring-security.adoc[Quarkus - Extension for Spring Security]
zh_cn: xref:spring-security.adoc[Quarkus - Spring Security 扩展]

source: xref:spring-web.adoc[Quarkus - Extension for Spring Web]
zh_cn: link:spring-web.html[Quarkus - Spring Web 扩展]

source: you can return different entity types depending on what happens in your method (a `Legume` or an `Error` for instance);
zh_cn: 你可以根据你的方法中发生的情况，返回不同的实体类型（例如， `Legume` 或 `Error` ）。

source: you can set the attributes of the `Response` (the status comes to mind in the case of an error).
zh_cn: 你可以设置 `Response` 的属性（在出现错误的情况下，会想到状态）。

source: your JDBC driver extension (`quarkus-jdbc-postgresql`, `quarkus-jdbc-h2`, `quarkus-jdbc-mariadb`, ...)
zh_cn: JDBC驱动扩展 ( `quarkus-jdbc-postgresql` , `quarkus-jdbc-h2` , `quarkus-jdbc-mariadb` , ...)

source: your reactive driver extension (`quarkus-reactive-pg-client`, `quarkus-reactive-mysql-client`, `quarkus-reactive-db2-client`, ...)
zh_cn: 响应式驱动扩展 ( `quarkus-reactive-pg-client` , `quarkus-reactive-mysql-client` , `quarkus-reactive-db2-client` , ...)

source: your selected filters
zh_cn: 您选择的筛选
